{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dtype": "float32", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_6", "trainable": true}}], "name": "sequential_1"}}